example/NEW_rk4projectionFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.2884274172;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 0.2884274172;
    }
    wall
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2884274172;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
