example/NEW_rk4projectionFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
   "libincompressibleRASModels.so"
    "liblduSolvers.so"
)

application     pisoFoam;

startFrom       latestTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 0.01;


// ************************************************************************* //

functions
{
    pressProbes
    {
            type        probes;
            outputControl timeStep;
            outputInterval 1;
            log true;
            functionObjectLibs ("libsampling.so");
            probeLocations
                    (
                     (0.2 0 0)
                    );
            fields (p);
    }
    forces
    {
        type        forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl timeStep;
        outputInterval 1;
        patches
        (
            wall
        );
        p       p;
        U       U;
        log         true;
        rhoInf      1;
        CofR        ( 0 0 0 );
        liftDir     ( 1 0 0 );
        dragDir     ( 0 1 0 );
        pitchAxis   ( 0 0 1 );
        magUInf     0.471;
        lRef        0.01;
        Aref        0.001;
    }
}
